let i = '';
do {
  i = +prompt("ทายซิ เลข 1 - 100 เลขอะไรเอ่ย?")

if(!isNaN(i) && i >= 1 && i <= 100){
  if(i === 55){
    alert("ถั่วต้วม!!!");
  }
  else if(i >= 56 && i <= 80){
    alert("มากไปนิด ลดลงมาหน่อย");
  }
  else if(i >= 81 && i <= 100){
    alert("เยอะเกินอาจารย์!!");
  }
  else if(i >= 30 && i <= 54){
    alert("ใกล้ถูกแล้ว เพิ่มอีกนิดนะจ๊ะ");
  }
  else if(i >= 1 && i <= 29){
    alert("น้อยโพด เพิ่มค่าอีกแหน่!!");
  }}
  else{
    alert("เอา 1 - 100 ครับพรี่!!")
  }
} while (i !== 55);
